package com.o2o.shop.exception;

import lombok.AllArgsConstructor;
import lombok.Getter;

/**
 * @author 勿忘初心
 * @since 2023-06-19-23:21
 * 全局异常错误码
 */
@AllArgsConstructor
@Getter
public enum ExceptionCodeEnum {
    // 操作成功
    EC0(0,"操作成功"),
    // 通用模块错误
    EC10000(10000,"系统内部错误"),
    EC10001(10001,"参数错误"),
    EC10002(10002,"资源不存在"),
    EC10003(10003,"token不合法或已过期"),
    EC10004(10004,"未授权用户"),
    EC10005(10005,"登录失败"),
    EC10006(10006,"请求的方法不被支持"),
    EC10007(10007,"该属性不允许重复"),
    EC10008(10008,"请选择要上传的图片"),
    EC10009(10009,"图片资源处理异常"),
    EC10010(10010,"操作失败"),
    EC10011(10011,"操作存在使用中的子项"),
    EC10012(10012,"图片文件超过指定大小"),

    // 用户模块错误
    EC20000(20000,"用户名已被占用"),
    EC20001(20001,"用户不存在"),
    EC20002(20002,"用户名或密码错误"),
    EC20003(20003,"用户信息初始化失败"),
    EC20004(20004,"该账号已被禁用"),
    EC20005(20005,"信息异常,请登录后重试"),
    EC20006(20006,"原密码不正确"),
    EC20007(20007,"新密码不能与原密码一致"),

    // 商品模块错误
    EC30000(30000,"商品信息不存在"),
    EC30001(30001,"分类信息不存在"),
    EC30003(30002,"没有更多的商品信息了"),
    EC30004(30003,"请求的商品列表为空"),
    EC30005(30005,"商品信息初始化失败"),
    EC30006(30006,"至少需要一张商品详情图"),
    EC30007(30007,"商品信息创建失败"),
    EC30008(30008,"请先创建一个商品类别"),
    EC30009(30009,"商品信息更新失败"),
    EC30010(30010,"当前类别含有在售的商品"),

    // 商铺模块
    EC40000(40000,"商铺信息不存在"),
    EC40001(40001,"商铺信息初始化失败"),
    EC40002(40002,"商铺创建失败"),
    EC40003(40003,"商铺创建数量已达上限"),
    EC40004(40004,"商铺信息修改失败"),
    EC40005(40005,"商铺类别创建失败"),
    EC40006(40006,"商铺处于审核或禁用状态"),

    // 订单模块
    EC50000(50000,"订单信息创建失败"),
    EC50001(50001,"订单中商品已经售罄"),
    EC50002(50002,"订单中存在已下架商品"),
    EC50003(50003,"订单中商品库存不足"),
    EC50004(50004,"订单中商品数量超过购买上限"),
    EC50005(50005,"订单中商品不能是0件"),
    EC50006(50006,"订单中优惠金额与实际金额不匹配"),
    EC50007(50007,"订单信息不存在"),
    EC50008(50008,"订单已过期"),
    EC50009(50009,"订单中的商品并不免费~"),
    EC50010(50010,"订单中商品信息异常"),

    // 积分模块
    EC60000(60000,"积分信息不存在"),

    // 奖品模块
    EC70000(70000,"奖品信息不存在"),
    EC70001(70001,"奖品信息创建失败"),
    EC70002(70002,"奖品信息更新失败");

    /**
     * 异常代码
     */
    private Integer code;
    /**
     * 描述信息
     */
    private String message;
}
